app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("body", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "11111"], ["title", "1111"], ["created_at", 2017-01-22 21:03:15 UTC], ["updated_at", 2017-01-22 21:03:15 UTC]]
---
  def create
    @blog = Blog.new(blog_params)
    @blog.save

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "blogs" SET "body" = $1, "title" = $2, "updated_at" = $3 WHERE "blogs"."id" = $4  [["body", "Not always.... "], ["title", "Kane is the best "], ["updated_at", 2017-01-22 23:46:17 UTC], ["id", 4]]
---
  def update
    # debugger
    @blog = Blog.find(params[:id])
    if @blog.update(blog_params)